<?php

/*
 * This file is part of Swoft.
 * (c) Swoft <group@swoft.org>
 * For the full copyright and license information, please view the LICENSE
 * file that was distributed with this source code.
 */

return [
    '0' => '成功',
    '1' => '操作失败',
    '10001' => '数据签名错误',
    '10002' => '操作内容不存在',

    '10500' => '用户不存在',
    '10501' => '用户名长度不符，用户长度应为2~20个字符',
    '10502' => '生日格式不正确，生日必须是1940年的之后',

    '30001' => '验证码错误',
    '30002' => '设置access_token失败',
    '30003' => '用户信息写入失败',
    '30004' => 'access_token不存在',
    '30005' => '请求已过期',
    '30006' => 'refreshToken已过期',

    '50000' => '文章不存在',
    '50001' => '文章分类不存在',
    '50002' => '文章标题涉及敏感词',
    '50003' => '文章内容涉及敏感词',
    '50004' => '文章内容必须5个字符以上',
    '50005' => '文章图片最多为9张',
    '50006' => '文章标题字数最多为40字',
    '50007' => '文章内容字数最多为2000字',

];
